// 1. Создай три числа и найди среди них самое большое ( number )

// 2. Проверь, находится ли возраст в диапазоне от 18 до 60 лет включительно ( true | false )

// 3. Создай константы username и password, затем попроси у 
//  пользователя ввести username и пароль. Eсли пользователь ввёл 
//  данные корректно - выведи “Вы успешно вошли в систему”, а если нет то
//  выведи “Некорректный username или пароль” 
//  ( “Вы успешно вошли в систему” | “Некорректный username или пароль” )

// 4. Создай тест из 5 вопросов и создай 5 констант с правильными ответами. 
// Попроси у пользователя ввести 5 ответов на всё 5 вопросов и 
// в конце выведи количество правильных ответов пользователя ( 0 | 1 | 2 | 3 | 4 | 5 )

// 5.  Если число делится на 2 или на 7, 
// выведи "Подходит" а иначе “Не подходит”  ( "Подходит" |  “Не подходит” )

// 6.  Если сумма покупки больше 5000, предоставь скидку 10% и выведи результат,
//  а иначе выведи саму сумму. ( number )

// 7.  Проверь, является ли символ гласной буквой (a, e, i, o, u). ( true | false )

// 8.  Попроси у пользователя число и процент, затем вычисли данный процент от данного числа ( number )


// Все значения кроме констант надо попросить у пользователя через prompt.
// В конце каждого элемента в списке в круглых скобках описано какие значения должны выводиться.

//////////////////////////////////////////////////////////////////////////////////////////////////////////
// 1.

const a = prompt("введите число a")
const b = prompt("введите число b")
const c = prompt("введите число c")

if (a > b && a > c ) {
    console.log(a)
}else if (b > a && b > c) {
    console.log(b)
}else {
    console.log(c)
}

/////////////////////////////////////////////////////////////////////////////////////////////////////
// 2.

const age = prompt("как минимум вам должно быть от 18 до 60 лет")

if (age >= 18 && age <= 60) {
    console.log(true)
}else {
    console.log(false)
}

/////////////////////////////////////////////////////////////////////////////////////////////////////
// 3.

const username = "islam"
const password = "12345"

const userUsername = prompt("введите имя")
const userPassword = prompt("введите пароль")

if (username === userUsername && password === userPassword) {
    console.log("Вы успешно вошли в систему")
}else {
    console.log("Некорректный username или пароль")
}

////////////////////////////////////////////////////////////////////////////////////////////////////
// 4.

const answer1 = "Париж";
const answer2 = "8";
const answer3 = "JavaScript";
const answer4 = "Бишкек";
const answer5 = "12";

const q1 = prompt("1. Столица Франции?");
const q2 = prompt("2. Сколько будет 4 + 4?");
const q3 = prompt("3. Как называется язык программирования, который ты изучаешь?");
const q4 = prompt("4. Столица Кыргызстана?");
const q5 = prompt("5. Сколько будет 6 + 6?");

let score = 0;

if (q1.toLowerCase() === answer1.toLowerCase()) score++;
if (q2 === answer2) score++;
if (q3.toLowerCase() === answer3.toLowerCase()) score++;
if (q4.toLowerCase() === answer4.toLowerCase()) score++;
if (q5 === answer5) score++;

console.log(`правильные ответы ${score}`);

////////////////////////////////////////////////////////////////////////////////////////////////////
// 5.

const number = prompt("Если число делится на 2 или на 7, выведи 'Подходит' а иначе “Не подходит”")

if(number % 2 === 0 || number % 7 === 0) {
    console.log("Подходит")
}else {
    console.log("Не подходит")
}

//////////////////////////////////////////////////////////////////////////////////////////////////////
// 6.

const proe = prompt("Если сумма покупки больше 5000, предоставь скидку 10% и выведи результат, а иначе выведи саму сумму. ( number )")

if(proe > 5000) {
    console.log(proe * 0.9)
}else {
    console.log(proe)
}

/////////////////////////////////////////////////////////////////////////////////////////////////////
// 7.

const letter = prompt("Проверь, является ли символ гласной буквой (a, e, i, o, u). ( true | false )")

// а это боле короткий вариант
console.log("a, e, i, o, u" .includes(letter.toLowerCase()))

// И вот ещё один вариант
// if(
//     letter === "a" || 
//     letter === "e" || 
//     letter === "i" || 
//     letter === "o" || 
//     letter === "u" ) {
//         console.log(true)
//     }else {
//         console.log(false)
//     }

/////////////////////////////////////////////////////////////////////////////////////////////////////////
// 8.

const numberr = prompt("введите сумму")
const percent = prompt("введите процент")

console.log(numberr * percent / 100)

// И ещё один вариант

const price = prompt("введите цену")
const percentt = prompt("введите процент скидки")

const discount = price * percentt / 100;

if(percent > 0 && percent <= 100) {
    console.log("Размер скидки:", discount)
    console.log("Цена после скидки:", price - discount)
}
